{
  "categories": {
    "classicos": {
      "name": "Relógios Clássicos",
      "description": "Nossa linha de relógios clássicos combina elegância atemporal com qualidade premium"
    },
    "esportivos": {
      "name": "Relógios Esportivos",
      "description": "Modelos resistentes e funcionais para acompanhar seu estilo de vida ativo"
    },
    "casuais": {
      "name": "Relógios Casuais",
      "description": "Relógios versáteis para o dia a dia, combinando conforto e estilo"
    }
  },
  "products": [
    {
      "id": "atlantis-masculino",
      "name": "Relógio Atlantis Masculino",
      "category": "classicos",
      "price": 80.00,
      "description": "Design robusto e elegante com pulseira metálica, mostrador moderno (preto ou prata) e resistência à água de até 50m. Ideal para quem busca estilo e durabilidade com ótimo custo-benefício."
    },
    {
      "id": "gshock-digital",
      "name": "Relógio Digital G-Shock",
      "category": "esportivos",
      "price": 35.90,
      "description": "Modelo esportivo com visual moderno e acabamento fosco. Resistente a impactos, com pulseira em silicone e visor digital com funções de hora, data e cronômetro. Perfeito para o dia a dia ou prática esportiva."
    },
    {
      "id": "atlantis-gold",
      "name": "Relógio Atlantis Gold",
      "category": "casuais",
      "price": 50.90,
      "description": "Modelo leve e moderno com pulseira de borracha texturizada e caixa dourada. Disponível em mostradores coloridos (preto, azul e vermelho), resistente à água até 50m."
    },
    {
      "id": "bulgari-cassino",
      "name": "Relógio Bulgari Cassino",
      "category": "classicos",
      "price": 90.90,
      "description": "Inspirado no glamour dos cassinos, esse modelo traz um mostrador temático com visual de roleta e acabamento dourado imponente. A pulseira metálica complementa o design sofisticado."
    },
    {
      "id": "festina-dourado",
      "name": "Relógio Festina Dourado",
      "category": "classicos",
      "price": 80.90,
      "description": "Com design robusto, mostrador multifuncional e acabamento totalmente dourado, o Festina transmite imponência e sofisticação."
    },
    {
      "id": "festina-gold-blue",
      "name": "Festina Gold Blue",
      "category": "classicos",
      "price": 80.00,
      "description": "Acabamento dourado premium e mostrador azul profundo. Equipado com cronógrafo funcional e estrutura robusta."
    },
    {
      "id": "festina-gold-white",
      "name": "Festina Gold White",
      "category": "classicos",
      "price": 80.90,
      "description": "Design imponente com pulseira dourada de alta resistência e mostrador branco detalhado que inspira elegância. Com funções de cronógrafo."
    },
    {
      "id": "bulgari-helice",
      "name": "Bulgari Hélice Azul",
      "category": "classicos",
      "price": 90.90,
      "description": "Um espetáculo visual com mostrador azul em formato de hélice, estrutura dourada imponente."
    },
    {
      "id": "atlantis-2em1",
      "name": "Atlantis 2 em 1",
      "category": "classicos",
      "price": 90.90,
      "description": "Combinando mostrador analógico clássico e visor digital funcional. Disponível nas versões branca e dourada, resistente à água (50M)."
    }
  ]
}
