{
  "categories": {
    "classicos": {
      "name": "Relógios Clássicos",
      "description": "Nossa linha de relógios clássicos combina elegância atemporal com qualidade premium"
    },
    "esportivos": {
      "name": "Relógios Esportivos",
      "description": "Modelos resistentes e funcionais para acompanhar seu estilo de vida ativo"
    },
    "casuais": {
      "name": "Relógios Casuais",
      "description": "Relógios versáteis para o dia a dia, combinando conforto e estilo"
    }
  },
  "products": [
    {
      "id": "atlantis-masculino",
      "name": "Relógio Atlantis Masculino",
      "category": "classicos",
      "price": 80.00,
      "description": "Design robusto e elegante com pulseira metálica, mostrador moderno (preto ou prata) e resistência à água de até 50m. Ideal para quem busca estilo e durabilidade com ótimo custo-benefício."
    },
    {
      "id": "gshock-digital",
      "name": "Relógio Digital G-Shock – Estilo e Resistência",
      "category": "esportivos",
      "price": 35.90,
      "description": "Modelo esportivo com visual moderno e acabamento fosco. Resistente a impactos, com pulseira em silicone e visor digital com funções de hora, data e cronômetro. Perfeito para o dia a dia ou prática esportiva."
    },
    {
      "id": "atlantis-gold",
      "name": "Relógio Atlantis Gold – Conforto e Sofisticação",
      "category": "casuais",
      "price": 50.90,
      "description": "Modelo leve e moderno com pulseira de borracha texturizada e caixa dourada. Disponível em mostradores coloridos (preto, azul e vermelho), resistente à água até 50m. Um acessório versátil que combina estilo e praticidade para o dia a dia."
    },
    {
      "id": "bulgari-cassino",
      "name": "Relógio Bulgari Cassino – Luxo com Personalidade Única",
      "category": "classicos",
      "price": 90.90,
      "description": "Inspirado no glamour dos cassinos, esse modelo traz um mostrador temático com visual de roleta e acabamento dourado imponente. A pulseira metálica complementa o design sofisticado, ideal para quem deseja se destacar com estilo e ousadia."
    },
    {
      "id": "festina-dourado",
      "name": "Relógio Festina Dourado – Presença e Prestígio",
      "category": "classicos",
      "price": 80.90,
      "description": "Com design robusto, mostrador multifuncional e acabamento totalmente dourado, o Festina transmite imponência e sofisticação. Ideal para quem busca um relógio de alto impacto visual sem abrir mão da elegância. Um acessório que transforma qualquer ocasião em um momento de destaque."
    },
    {
      "id": "festina-gold-blue",
      "name": "Festina Gold Blue – Sofisticação com Espírito Esportivo",
      "category": "classicos",
      "price": 80.00,
      "description": "Um relógio que impõe respeito com seu acabamento dourado premium e mostrador azul profundo. Equipado com cronógrafo funcional e estrutura robusta, é a escolha perfeita para quem valoriza estilo, desempenho e destaque em qualquer ocasião. Elegância esportiva com presença de luxo."
    },
    {
      "id": "festina-gold-white",
      "name": "Festina Gold White – Impacto Visual e Sofisticação",
      "category": "classicos",
      "price": 80.90,
      "description": "Design imponente com pulseira dourada de alta resistência e mostrador branco detalhado que inspira elegância. Ideal para quem deseja um acessório versátil que combina com eventos casuais ou formais. Com funções de cronógrafo, é mais do que um relógio – é um símbolo de presença."
    },
    {
      "id": "bulgari-helice",
      "name": "Bulgari Hélice Azul – Design que Gira Cabeças",
      "category": "classicos",
      "price": 90.90,
      "description": "Um espetáculo visual com mostrador azul em formato de hélice, este relógio Bulgari une ousadia e sofisticação. Sua estrutura dourada impõe respeito, enquanto o mostrador dinâmico garante exclusividade. Ideal para quem quer se destacar com estilo e modernidade."
    },
    {
      "id": "atlantis-2em1",
      "name": "Atlantis 2 em 1 – Elegância e Tecnologia à Prova d'Água",
      "category": "classicos",
      "price": 90.90,
      "description": "Combinando mostrador analógico clássico e visor digital funcional, o Atlantis 2 em 1 oferece praticidade sem perder o estilo. Disponível nas versões branca e dourada, este modelo é resistente à água (50M) e ideal para quem busca versatilidade e presença marcante no pulso."
    }
  ]
}
